In [1]:
import json
import numpy as np
import csv
import requests
import pandas as pd
from config import api_key
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
#url = "https://api.data.gov/ed/collegescorecard/v1/schools.json?&_fields=id,school.name&api_key=" + api_key

In [3]:
# Feesdata table cleaning
fees_data= "feesdata.csv"
fees_data_file = pd.read_csv(fees_data)
fees_data_file.head()
fees_data_rename = fees_data_file.rename(columns={"Unnamed:0":"A","id":"school_id","latest.cost.attendance.academic_year":"school_cost","latest.cost.tuition.in_state": "school_fees_national","latest.cost.tuition.out_of_state":"school_fees_international","school.school_url":"school_url"})
fees_data_rename.head()
fees_data_final= fees_data_rename.drop("Unnamed: 0" , axis=1)

In [4]:
fees_data_final.head()

,school_id,school_cost,school_fees_national,school_fees_international,school_url
0,193894,NaN,NaN,NaN,nyts.edu
1,139287,21156.0,10460.0,10460.0,www.carver.edu
2,449038,29544.0,12975.0,12975.0,www.strayer.edu/florida/tampa-westshore
3,450298,29544.0,12975.0,12975.0,www.strayer.edu/delaware/christiana
4,457332,NaN,NaN,NaN,www.teachbeauty.com

In [5]:
# Feesdata table cleaning
address_data= "addressdata.csv"
address_data_file = pd.read_csv(address_data)
address_data_file.head()
address_data_rename = address_data_file.rename(columns={"id":"school_id","school.city":"city","school.state": "state","school.zip":"zipcode"})
address_data_rename.head()
address_data_final= address_data_rename.drop("Unnamed: 0" , axis=1)

In [6]:
address_data_final.head()

   school_id      city state     zipcode
0     193894  New York    NY       10115
1     139287   Atlanta    GA       30331
2     449038     Tampa    FL       33634
3     450298    Newark    DE       19713
4     457332  Guilford    CT  06437-2319

In [7]:
#scoredata cleaning
score_data= "ScoreData.csv"
score_data_file = pd.read_csv(score_data)
score_data_file.head()
score_data_rename = score_data_file.rename(columns={"id":"school_id","latest.admissions.admission_rate.overall":"admission_rate","latest.admissions.sat_scores.average.overall": "sat_score","latest.student.FAFSA_applications":"fafsa"})
score_data_rename.head()
score_data_rename=score_data_rename.drop("school.name", axis=1)
score_data_final= score_data_rename.drop("Unnamed: 0" , axis=1)

In [8]:
score_data_final.head()

   school_id  admission_rate  sat_score    fafsa
0     193894             NaN        NaN      NaN
1     139287             NaN        NaN     16.0
2     449038             NaN        NaN  29659.0
3     450298             NaN        NaN  29659.0
4     457332             NaN        NaN     32.0

In [9]:
school_data="CollegeNewData.csv"
school_data_df=pd.read_csv(school_data)
school_data_final= score_data_rename.drop("Unnamed: 0" , axis=1)

In [10]:
school_data_final.head()

   school_id  admission_rate  sat_score    fafsa
0     193894             NaN        NaN      NaN
1     139287             NaN        NaN     16.0
2     449038             NaN        NaN  29659.0
3     450298             NaN        NaN  29659.0
4     457332             NaN        NaN     32.0

In [11]:
school_rank="National Universities Rankings New.csv"
school_rank_df=pd.read_csv(school_rank)
school_rank_df= school_rank_df.drop("Unnamed: 2" , axis=1)
school_rank_df= school_rank_df.drop("Unnamed: 3" , axis=1)
school_rank_df= school_rank_df.drop("Unnamed: 4" , axis=1)
school_rank_final= school_rank_df.drop("Unnamed: 5" , axis=1)

In [12]:
school_rank_final.head()

                    Name  Rank
0   Princeton University     1
1     Harvard University     2
2  University of Chicago     3
3        Yale University     3
4    Columbia University     5

In [15]:
rds_connection_string = "root:Pimn@2001@127.0.0.1/school_uni_db"
engine = create_engine(f'mysql://{rds_connection_string}')

In [16]:
school_rank_final.to_sql("school_rank", con = engine, schema=None, if_exists='replace', index=False)

In [17]:
fees_data_final.to_sql("school_fees", con = engine, schema=None, if_exists='replace', index=False)

In [18]:
address_data_final.to_sql("school_address", con = engine, schema=None, if_exists='replace', index=False)

In [19]:
school_data_final.to_sql("school_scores", con = engine, schema=None, if_exists='replace', index=False)